backend/app/validators/email_validator.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test13@mail.com"], ["LIMIT", 1]]
---
  def validate(record)
    email = record.email

    if email.blank?
      record.errors.add(:email, "не может быть пустым")
    end

    if User.exists?(email: email)