backend/app/controllers/api/v1/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test8@mail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-10-12 13:34:14.549464"], ["updated_at", "2024-10-12 13:34:14.549464"]]
---
  def create
    user = User.create(user_params)