backend/app/controllers/api/v1/users_controller.rb

  def destroy
    Rails.logger.info "Params: #{params.inspect}"
    user = User.find_by(email: user_params[:email])

    if current_user.nil?
      render json: { errors: 'User not authenticated.' }, status: :unauthorized
      return
    end

    if user && user.authenticate(user_params[:password]) && user.id == current_user.id
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]