backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def destroy
    user = User.find_by(id: params[:id])